espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/io_mux_eco5_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: IOMUX Register */
/** Type of gpio0 register
 *  iomux control register for gpio0
 */
typedef union {
    struct {
        /** gpio0_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio0_mcu_oe:1;
        /** gpio0_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio0_slp_sel:1;
        /** gpio0_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio0_mcu_wpd:1;
        /** gpio0_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio0_mcu_wpu:1;
        /** gpio0_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio0_mcu_ie:1;
        /** gpio0_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio0_mcu_drv:2;
        /** gpio0_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio0_fun_wpd:1;
        /** gpio0_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio0_fun_wpu:1;
        /** gpio0_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio0_fun_ie:1;
        /** gpio0_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio0_fun_drv:2;
        /** gpio0_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio0_mcu_sel:3;
        /** gpio0_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio0_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio0_reg_t;

/** Type of gpio1 register
 *  iomux control register for gpio1
 */
typedef union {
    struct {
        /** gpio1_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio1_mcu_oe:1;
        /** gpio1_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio1_slp_sel:1;
        /** gpio1_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio1_mcu_wpd:1;
        /** gpio1_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio1_mcu_wpu:1;
        /** gpio1_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio1_mcu_ie:1;
        /** gpio1_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio1_mcu_drv:2;
        /** gpio1_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio1_fun_wpd:1;
        /** gpio1_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio1_fun_wpu:1;
        /** gpio1_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio1_fun_ie:1;
        /** gpio1_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio1_fun_drv:2;
        /** gpio1_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio1_mcu_sel:3;
        /** gpio1_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio1_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio1_reg_t;

/** Type of gpio2 register
 *  iomux control register for gpio2
 */
typedef union {
    struct {
        /** gpio2_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio2_mcu_oe:1;
        /** gpio2_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio2_slp_sel:1;
        /** gpio2_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio2_mcu_wpd:1;
        /** gpio2_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio2_mcu_wpu:1;
        /** gpio2_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio2_mcu_ie:1;
        /** gpio2_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio2_mcu_drv:2;
        /** gpio2_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio2_fun_wpd:1;
        /** gpio2_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio2_fun_wpu:1;
        /** gpio2_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio2_fun_ie:1;
        /** gpio2_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio2_fun_drv:2;
        /** gpio2_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio2_mcu_sel:3;
        /** gpio2_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio2_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio2_reg_t;

