espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/io_mux_eco5_struct.h
/** Type of gpio3 register
 *  iomux control register for gpio3
 */
typedef union {
    struct {
        /** gpio3_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio3_mcu_oe:1;
        /** gpio3_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio3_slp_sel:1;
        /** gpio3_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio3_mcu_wpd:1;
        /** gpio3_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio3_mcu_wpu:1;
        /** gpio3_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio3_mcu_ie:1;
        /** gpio3_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio3_mcu_drv:2;
        /** gpio3_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio3_fun_wpd:1;
        /** gpio3_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio3_fun_wpu:1;
        /** gpio3_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio3_fun_ie:1;
        /** gpio3_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio3_fun_drv:2;
        /** gpio3_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio3_mcu_sel:3;
        /** gpio3_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio3_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio3_reg_t;

/** Type of gpio4 register
 *  iomux control register for gpio4
 */
typedef union {
    struct {
        /** gpio4_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio4_mcu_oe:1;
        /** gpio4_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio4_slp_sel:1;
        /** gpio4_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio4_mcu_wpd:1;
        /** gpio4_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio4_mcu_wpu:1;
        /** gpio4_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio4_mcu_ie:1;
        /** gpio4_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio4_mcu_drv:2;
        /** gpio4_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio4_fun_wpd:1;
        /** gpio4_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio4_fun_wpu:1;
        /** gpio4_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio4_fun_ie:1;
        /** gpio4_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio4_fun_drv:2;
        /** gpio4_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio4_mcu_sel:3;
        /** gpio4_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio4_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio4_reg_t;

/** Type of gpio5 register
 *  iomux control register for gpio5
 */
typedef union {
    struct {
        /** gpio5_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio5_mcu_oe:1;
        /** gpio5_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio5_slp_sel:1;
        /** gpio5_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio5_mcu_wpd:1;
        /** gpio5_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio5_mcu_wpu:1;
        /** gpio5_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio5_mcu_ie:1;
        /** gpio5_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio5_mcu_drv:2;
        /** gpio5_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio5_fun_wpd:1;
        /** gpio5_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio5_fun_wpu:1;
        /** gpio5_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio5_fun_ie:1;
        /** gpio5_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio5_fun_drv:2;
        /** gpio5_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio5_mcu_sel:3;
        /** gpio5_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio5_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio5_reg_t;

/** Type of gpio6 register
 *  iomux control register for gpio6
 */
typedef union {
    struct {
        /** gpio6_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio6_mcu_oe:1;
        /** gpio6_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio6_slp_sel:1;
        /** gpio6_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio6_mcu_wpd:1;
        /** gpio6_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio6_mcu_wpu:1;
        /** gpio6_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio6_mcu_ie:1;
        /** gpio6_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio6_mcu_drv:2;
        /** gpio6_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio6_fun_wpd:1;
        /** gpio6_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio6_fun_wpu:1;
        /** gpio6_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio6_fun_ie:1;
        /** gpio6_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio6_fun_drv:2;
        /** gpio6_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio6_mcu_sel:3;
        /** gpio6_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio6_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio6_reg_t;

/** Type of gpio7 register
 *  iomux control register for gpio7
 */
typedef union {
    struct {
        /** gpio7_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio7_mcu_oe:1;
        /** gpio7_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio7_slp_sel:1;
        /** gpio7_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio7_mcu_wpd:1;
        /** gpio7_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio7_mcu_wpu:1;
        /** gpio7_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio7_mcu_ie:1;
        /** gpio7_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio7_mcu_drv:2;
        /** gpio7_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio7_fun_wpd:1;
        /** gpio7_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio7_fun_wpu:1;
        /** gpio7_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio7_fun_ie:1;
        /** gpio7_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio7_fun_drv:2;
        /** gpio7_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio7_mcu_sel:3;
        /** gpio7_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio7_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio7_reg_t;

/** Type of gpio8 register
 *  iomux control register for gpio8
 */
typedef union {
    struct {
        /** gpio8_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio8_mcu_oe:1;
        /** gpio8_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio8_slp_sel:1;
        /** gpio8_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio8_mcu_wpd:1;
        /** gpio8_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio8_mcu_wpu:1;
        /** gpio8_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio8_mcu_ie:1;
        /** gpio8_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio8_mcu_drv:2;
        /** gpio8_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio8_fun_wpd:1;
        /** gpio8_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio8_fun_wpu:1;
        /** gpio8_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio8_fun_ie:1;
        /** gpio8_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio8_fun_drv:2;
        /** gpio8_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio8_mcu_sel:3;
        /** gpio8_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio8_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio8_reg_t;

/** Type of gpio9 register
 *  iomux control register for gpio9
 */
typedef union {
    struct {
        /** gpio9_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio9_mcu_oe:1;
        /** gpio9_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio9_slp_sel:1;
        /** gpio9_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio9_mcu_wpd:1;
        /** gpio9_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio9_mcu_wpu:1;
        /** gpio9_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio9_mcu_ie:1;
        /** gpio9_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio9_mcu_drv:2;
        /** gpio9_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio9_fun_wpd:1;
        /** gpio9_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio9_fun_wpu:1;
        /** gpio9_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio9_fun_ie:1;
        /** gpio9_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio9_fun_drv:2;
        /** gpio9_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio9_mcu_sel:3;
        /** gpio9_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio9_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio9_reg_t;

