espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/io_mux_eco5_struct.h
/** Type of gpio37 register
 *  iomux control register for gpio37
 */
typedef union {
    struct {
        /** gpio37_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio37_mcu_oe:1;
        /** gpio37_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio37_slp_sel:1;
        /** gpio37_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio37_mcu_wpd:1;
        /** gpio37_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio37_mcu_wpu:1;
        /** gpio37_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio37_mcu_ie:1;
        /** gpio37_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio37_mcu_drv:2;
        /** gpio37_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio37_fun_wpd:1;
        /** gpio37_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio37_fun_wpu:1;
        /** gpio37_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio37_fun_ie:1;
        /** gpio37_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio37_fun_drv:2;
        /** gpio37_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio37_mcu_sel:3;
        /** gpio37_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio37_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio37_reg_t;

/** Type of gpio38 register
 *  iomux control register for gpio38
 */
typedef union {
    struct {
        /** gpio38_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio38_mcu_oe:1;
        /** gpio38_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio38_slp_sel:1;
        /** gpio38_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio38_mcu_wpd:1;
        /** gpio38_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio38_mcu_wpu:1;
        /** gpio38_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio38_mcu_ie:1;
        /** gpio38_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio38_mcu_drv:2;
        /** gpio38_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio38_fun_wpd:1;
        /** gpio38_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio38_fun_wpu:1;
        /** gpio38_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio38_fun_ie:1;
        /** gpio38_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio38_fun_drv:2;
        /** gpio38_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio38_mcu_sel:3;
        /** gpio38_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio38_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio38_reg_t;

/** Type of gpio39 register
 *  iomux control register for gpio39
 */
typedef union {
    struct {
        /** gpio39_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio39_mcu_oe:1;
        /** gpio39_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio39_slp_sel:1;
        /** gpio39_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio39_mcu_wpd:1;
        /** gpio39_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio39_mcu_wpu:1;
        /** gpio39_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio39_mcu_ie:1;
        /** gpio39_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio39_mcu_drv:2;
        /** gpio39_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio39_fun_wpd:1;
        /** gpio39_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio39_fun_wpu:1;
        /** gpio39_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio39_fun_ie:1;
        /** gpio39_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio39_fun_drv:2;
        /** gpio39_mcu_sel : R/W; bitpos: [14:12]; default: 1;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio39_mcu_sel:3;
        /** gpio39_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio39_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio39_reg_t;

/** Type of gpio40 register
 *  iomux control register for gpio40
 */
typedef union {
    struct {
        /** gpio40_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio40_mcu_oe:1;
        /** gpio40_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio40_slp_sel:1;
        /** gpio40_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio40_mcu_wpd:1;
        /** gpio40_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio40_mcu_wpu:1;
        /** gpio40_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio40_mcu_ie:1;
        /** gpio40_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio40_mcu_drv:2;
        /** gpio40_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio40_fun_wpd:1;
        /** gpio40_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio40_fun_wpu:1;
        /** gpio40_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio40_fun_ie:1;
        /** gpio40_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio40_fun_drv:2;
        /** gpio40_mcu_sel : R/W; bitpos: [14:12]; default: 1;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio40_mcu_sel:3;
        /** gpio40_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio40_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio40_reg_t;

