espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/io_mux_eco5_struct.h
/** Type of gpio54 register
 *  iomux control register for gpio54
 */
typedef union {
    struct {
        /** gpio54_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio54_mcu_oe:1;
        /** gpio54_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio54_slp_sel:1;
        /** gpio54_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio54_mcu_wpd:1;
        /** gpio54_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio54_mcu_wpu:1;
        /** gpio54_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio54_mcu_ie:1;
        /** gpio54_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio54_mcu_drv:2;
        /** gpio54_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio54_fun_wpd:1;
        /** gpio54_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio54_fun_wpu:1;
        /** gpio54_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio54_fun_ie:1;
        /** gpio54_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio54_fun_drv:2;
        /** gpio54_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio54_mcu_sel:3;
        /** gpio54_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio54_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio54_reg_t;

/** Type of gpio55 register
 *  iomux control register for gpio55
 */
typedef union {
    struct {
        /** gpio55_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio55_mcu_oe:1;
        /** gpio55_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio55_slp_sel:1;
        /** gpio55_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio55_mcu_wpd:1;
        /** gpio55_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio55_mcu_wpu:1;
        /** gpio55_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio55_mcu_ie:1;
        /** gpio55_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio55_mcu_drv:2;
        /** gpio55_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio55_fun_wpd:1;
        /** gpio55_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio55_fun_wpu:1;
        /** gpio55_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio55_fun_ie:1;
        /** gpio55_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio55_fun_drv:2;
        /** gpio55_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio55_mcu_sel:3;
        /** gpio55_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio55_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio55_reg_t;

/** Type of gpio56 register
 *  iomux control register for gpio56
 */
typedef union {
    struct {
        /** gpio56_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio56_mcu_oe:1;
        /** gpio56_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio56_slp_sel:1;
        /** gpio56_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio56_mcu_wpd:1;
        /** gpio56_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio56_mcu_wpu:1;
        /** gpio56_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio56_mcu_ie:1;
        /** gpio56_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strength on sleep mode
         */
        uint32_t gpio56_mcu_drv:2;
        /** gpio56_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio56_fun_wpd:1;
        /** gpio56_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio56_fun_wpu:1;
        /** gpio56_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio56_fun_ie:1;
        /** gpio56_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio56_fun_drv:2;
        /** gpio56_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio56_mcu_sel:3;
        /** gpio56_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio56_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio56_reg_t;

/** Type of date register
 *  iomux version
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 2101794;
         *  csv date
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} io_mux_date_reg_t;


