espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/io_mux_eco5_struct.h
typedef struct {
    uint32_t reserved_000;
    volatile io_mux_gpio0_reg_t gpio0;
    volatile io_mux_gpio1_reg_t gpio1;
    volatile io_mux_gpio2_reg_t gpio2;
    volatile io_mux_gpio3_reg_t gpio3;
    volatile io_mux_gpio4_reg_t gpio4;
    volatile io_mux_gpio5_reg_t gpio5;
    volatile io_mux_gpio6_reg_t gpio6;
    volatile io_mux_gpio7_reg_t gpio7;
    volatile io_mux_gpio8_reg_t gpio8;
    volatile io_mux_gpio9_reg_t gpio9;
    volatile io_mux_gpio10_reg_t gpio10;
    volatile io_mux_gpio11_reg_t gpio11;
    volatile io_mux_gpio12_reg_t gpio12;
    volatile io_mux_gpio13_reg_t gpio13;
    volatile io_mux_gpio14_reg_t gpio14;
    volatile io_mux_gpio15_reg_t gpio15;
    volatile io_mux_gpio16_reg_t gpio16;
    volatile io_mux_gpio17_reg_t gpio17;
    volatile io_mux_gpio18_reg_t gpio18;
    volatile io_mux_gpio19_reg_t gpio19;
    volatile io_mux_gpio20_reg_t gpio20;
    volatile io_mux_gpio21_reg_t gpio21;
    volatile io_mux_gpio22_reg_t gpio22;
    volatile io_mux_gpio23_reg_t gpio23;
    volatile io_mux_gpio24_reg_t gpio24;
    volatile io_mux_gpio25_reg_t gpio25;
    volatile io_mux_gpio26_reg_t gpio26;
    volatile io_mux_gpio27_reg_t gpio27;
    volatile io_mux_gpio28_reg_t gpio28;
    volatile io_mux_gpio29_reg_t gpio29;
    volatile io_mux_gpio30_reg_t gpio30;
    volatile io_mux_gpio31_reg_t gpio31;
    volatile io_mux_gpio32_reg_t gpio32;
    volatile io_mux_gpio33_reg_t gpio33;
    volatile io_mux_gpio34_reg_t gpio34;
    volatile io_mux_gpio35_reg_t gpio35;
    volatile io_mux_gpio36_reg_t gpio36;
    volatile io_mux_gpio37_reg_t gpio37;
    volatile io_mux_gpio38_reg_t gpio38;
    volatile io_mux_gpio39_reg_t gpio39;
    volatile io_mux_gpio40_reg_t gpio40;
    volatile io_mux_gpio41_reg_t gpio41;
    volatile io_mux_gpio42_reg_t gpio42;
    volatile io_mux_gpio43_reg_t gpio43;
    volatile io_mux_gpio44_reg_t gpio44;
    volatile io_mux_gpio45_reg_t gpio45;
    volatile io_mux_gpio46_reg_t gpio46;
    volatile io_mux_gpio47_reg_t gpio47;
    volatile io_mux_gpio48_reg_t gpio48;
    volatile io_mux_gpio49_reg_t gpio49;
    volatile io_mux_gpio50_reg_t gpio50;
    volatile io_mux_gpio51_reg_t gpio51;
    volatile io_mux_gpio52_reg_t gpio52;
    volatile io_mux_gpio53_reg_t gpio53;
    volatile io_mux_gpio54_reg_t gpio54;
    volatile io_mux_gpio55_reg_t gpio55;
    volatile io_mux_gpio56_reg_t gpio56;
    uint32_t reserved_0e8[7];
    volatile io_mux_date_reg_t date;
} io_mux_dev_t;

extern io_mux_dev_t IO_MUX;

#ifndef __cplusplus
_Static_assert(sizeof(io_mux_dev_t) == 0x108, "Invalid size of io_mux_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
